БылковДА_70180166/src/Documents/ПротоколЗаседанияКомиссии/ПротоколЗаседанияКомиссии.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколЗаседанияКомиссии</name>
  <basedOn>Document.РекомендацииПоСтудентам</basedOn>
  <registerRecords>InformationRegister.ТекущийСтатусЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.ДинамикаЛиквидацииЗадолженностей</registerRecords>
  <registerRecords>AccumulationRegister.УспешныеПересдачи</registerRecords>
  <attributes>
    <name>Студент</name>
    <type>
      <types>CatalogRef.Студенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>CatalogRef.Группы</types>
    </type>
  </attributes>
  <attributes>
    <name>Семестр</name>
    <type>
      <types>EnumRef.Семестры</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоВозникшихЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоЛиквидированныхЗадолженностей</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

БылковДА_70180166/src/Documents/ПротоколЗаседанияКомиссии/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = КоличествоВозникшихЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;

	
	Движения.ДинамикаЛиквидацииЗадолженностей.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.ДинамикаЛиквидацииЗадолженностей.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Семестр = Семестр;
		Движение.КоличествоВозникшихЗадолженностей = КоличествоВозникшихЗадолженностей;
		Движение.КоличествоЛиквидированныхЗадолженностей = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;
	
	
	Движения.УспешныеПересдачи.Записывать = Истина;
	Для Каждого ТекСтрокаДолги Из Долги Цикл
		Движение = Движения.УспешныеПересдачи.Добавить();
		Движение.Период = Дата;
		Движение.Студент = Студент;
		Движение.Группа = Группа;
		Движение.Дисциплина = ТекСтрокаДолги.Дисциплина;
		Движение.КоличествоУспешныхПересдач = КоличествоЛиквидированныхЗадолженностей;
	КонецЦикла;

	КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РекомендацииПоСтудентам") Тогда
		
		Группа = ДанныеЗаполнения.Группа;
		Студент = ДанныеЗаполнения.Студент;
	КонецЕсли;
	
КонецПроцедуры
